Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: To gauge your tank pressure, a simple step is to open the valve on each of the bottles. Subsequently, the adjusting screws on the regulators come into play. These are tweaked until your desired working pressure is attained. For instance, for a #2 tip designated for a 1/8-inch thickness, both the oxygen and acetylene should be calibrated to 3 psi. An important thing to understand is: For all the tips you may use, the ratio of the working pressures will always be 1 - to - one. 3 psi for Oxygen as well as 3 psi for Acetylene or 5 psi for Oxygen and 5 psi depending on the manufacturer of you brand of equipment. Don't make the mistake of thinking you need to increase the working pressures on your oxygen and acetylene bottles in the hopes you will get a hotter flame. All your doing is wasting your gas. There is not one instance except for a 'Rosebud" tip that your pressures should ever be over 8 psi. A critical point of consideration revolves around the bottle's valve turns. The oxygen valve necessitates complete opening until it is firmly seated. In contrast, the acetylene bottle requires a more nuanced approach: it should only be opened just enough to establish tank pressure. This differential handling stems from safety considerations: in emergencies, the acetylene tank must be the first to be shut off, even before the oxygen bottle, which is why its full opening is discouraged. As for the torch lighting sequence, it’s paramount to open the acetylene valve first. Employing a flint striker, initiate a flame, adjusting it until the pronounced carbon soot significantly diminishes. Gradually, introduce oxygen to the flame, fine-tuning until you achieve a neutral flame. Upon conclusion of the welding, a strict protocol is observed: shut off the acetylene first, extinguishing the flame, followed by the oxygen. This sequence ensures the absence of lingering acetylene in the tip post-operation.
es_419: Para medir la presión de su tanque, un paso simple es abrir la válvula en cada una de las botellas. Posteriormente entran en juego los tornillos de ajuste de los reguladores. Estos se ajustan hasta alcanzar la presión de trabajo deseada. Por ejemplo, para una punta n.º 2 diseñada para un grosor de 1/8 de pulgada, tanto el oxígeno como el acetileno deben calibrarse a 3 psi. Algo importante que debe comprender es: Para todas las puntas que pueda utilizar, la relación de las presiones de trabajo siempre será de 1 a uno. 3 psi para oxígeno así como 3 psi para acetileno o 5 psi para oxígeno y 5 psi dependiendo del fabricante de su marca de equipo. No cometa el error de pensar que necesita aumentar la presión de trabajo de sus botellas de oxígeno y acetileno con la esperanza de obtener una llama más caliente. Todo lo que haces es desperdiciar tu gasolina. No hay un solo caso, excepto por una punta "Rosebud", en el que sus presiones deban ser superiores a 8 psi. Un punto crítico a considerar gira en torno a los giros de las válvulas de la botella. Es necesario abrir completamente la válvula de oxígeno hasta que esté firmemente asentada. Por el contrario, la botella de acetileno requiere un enfoque más matizado: sólo debe abrirse lo suficiente para establecer la presión del tanque. Este manejo diferencial se debe a consideraciones de seguridad: en caso de emergencia, el tanque de acetileno debe ser el primero en cerrarse, incluso antes que la botella de oxígeno, por lo que se desaconseja su apertura total. En cuanto a la secuencia de encendido de la antorcha, es fundamental abrir primero la válvula de acetileno. Con un percutor de pedernal, inicie la llama y ajústela hasta que el pronunciado hollín de carbón disminuya significativamente. Poco a poco, introduce oxígeno a la llama, afinando hasta conseguir una llama neutra. Al finalizar la soldadura, se sigue un estricto protocolo: cortar primero el acetileno, apagando la llama, y ​​luego el oxígeno. Esta secuencia asegura la ausencia de acetileno persistente en la punta después de la operación.
fil_ph: Upang masukat ang presyon ng iyong tangke, isang simpleng hakbang ay buksan ang balbula sa bawat bote. Kasunod nito, ang pag-aayos ng mga turnilyo sa mga regulator ay naglalaro. Ang mga ito ay tweaked hanggang sa ang iyong ninanais na presyon sa pagtatrabaho ay matamo. Halimbawa, para sa #2 tip na itinalaga para sa 1/8-inch na kapal, ang oxygen at acetylene ay dapat na naka-calibrate sa 3 psi. Ang isang mahalagang bagay na dapat maunawaan ay: Para sa lahat ng mga tip na maaari mong gamitin, ang ratio ng mga gumaganang pressure ay palaging magiging 1 - sa - isa. 3 psi para sa Oxygen pati na rin 3 psi para sa Acetylene o 5 psi para sa Oxygen at 5 psi depende sa tagagawa ng iyong tatak ng kagamitan. Huwag magkamali sa pag-iisip na kailangan mong dagdagan ang gumaganang presyon sa iyong mga bote ng oxygen at acetylene sa pag-asang magkakaroon ka ng mas mainit na apoy. Ang lahat ng iyong ginagawa ay pag-aaksaya ng iyong gas. Walang isang pagkakataon maliban sa isang tip na 'Rosebud" na ang iyong mga presyon ay dapat na higit sa 8 psi. Ang isang kritikal na punto ng pagsasaalang-alang ay umiikot sa pagliko ng balbula ng bote. Ang balbula ng oxygen ay nangangailangan ng kumpletong pagbubukas hanggang sa ito ay matatag na nakaupo. Sa kabaligtaran, ang bote ng acetylene ay nangangailangan ng isang mas nuanced na diskarte: dapat lamang itong buksan nang sapat upang maitatag ang presyon ng tangke. Ang differential handling na ito ay nagmumula sa mga pagsasaalang-alang sa kaligtasan: sa mga emerhensiya, ang tangke ng acetylene ay dapat ang unang nakasara, bago pa man ang bote ng oxygen, kaya naman hindi hinihikayat ang buong pagbukas nito. Tulad ng para sa pagkakasunud-sunod ng pag-iilaw ng sulo, pinakamahalagang buksan muna ang balbula ng acetylene. Gumagamit ng isang flint striker, simulan ang isang apoy, inaayos ito hanggang sa ang binibigkas na carbon soot ay makabuluhang lumiit. Unti-unti, ipasok ang oxygen sa apoy, fine-tuning hanggang sa makamit mo ang isang neutral na apoy. Sa pagtatapos ng hinang, isang mahigpit na protocol ang sinusunod: patayin muna ang acetylene, patayin ang apoy, na sinusundan ng oxygen. Tinitiyak ng sequence na ito ang kawalan ng matagal na acetylene sa dulo pagkatapos ng operasyon.
ht: Pou mezire presyon tank ou a, yon etap senp se louvri valv la sou chak nan boutèy yo. Imedyatman, vis yo ajiste sou regilatè yo antre nan jwèt. Sa yo tweaked jiskaske presyon travay ou vle rive. Pou egzanp, pou yon pwent #2 ki deziyen pou yon epesè 1/8-pous, tou de oksijèn ak asetilèn yo ta dwe kalibre a 3 psi. Yon bagay enpòtan yo konprann se: Pou tout konsèy ou ka itilize, rapò a nan presyon k ap travay yo ap toujou 1 - a - youn. 3 psi pou oksijèn osi byen ke 3 psi pou asetilèn oswa 5 psi pou oksijèn ak 5 psi depann sou manifakti a nan mak ou nan ekipman yo. Pa fè erè nan panse ou bezwen ogmante presyon k ap travay sou boutèy oksijèn ak asetilèn ou nan espwa ou pral jwenn yon flanm dife pi cho. Tout sa w ap fè se gaspiye gaz ou. Pa gen yon sèl egzanp eksepte pou yon pwent "Rosebud" ke presyon ou ta dwe janm plis pase 8 psi. Yon pwen enpòtan nan konsiderasyon vire toutotou vire valv boutèy la. Valv oksijèn an bezwen ouvèti konplè jiskaske li byen chita. Nan kontras, boutèy la asetilèn mande pou yon apwòch plis nuans: li ta dwe sèlman louvri jis ase yo etabli presyon tank la. Manyen diferans sa a soti nan konsiderasyon sekirite: nan ijans, tank asetilèn nan dwe premye a fèmen, menm anvan boutèy oksijèn nan, ki se poukisa ouvèti konplè li yo dekouraje. Kòm pou sekans ekleraj flanbo a, li esansyèl pou louvri valv asetilèn an premye. Anplwaye yon atakan flint, kòmanse yon flanm dife, ajiste li jiskaske swi kabòn pwononse a diminye anpil. Piti piti, prezante oksijèn nan flanm dife a, ajiste amann jiskaske ou reyalize yon flanm dife net. Lè yo fin soude a, yo obsève yon pwotokòl strik: fèmen asetilèn nan premye, etenn flanm dife a, ki te swiv pa oksijèn an. Sekans sa a asire absans asetilèn ki pèsistan nan pwent apre operasyon an.
pt_br: Para medir a pressão do tanque, um passo simples é abrir a válvula de cada uma das garrafas. Posteriormente, os parafusos de ajuste dos reguladores entram em ação. Eles são ajustados até que a pressão de trabalho desejada seja atingida. Por exemplo, para uma ponta nº 2 designada para espessura de 1/8 de polegada, tanto o oxigênio quanto o acetileno devem ser calibrados para 3 psi. Uma coisa importante a entender é: para todas as dicas que você usar, a proporção das pressões de trabalho será sempre de 1 para um. 3 psi para oxigênio, bem como 3 psi para acetileno ou 5 psi para oxigênio e 5 psi dependendo do fabricante da marca do seu equipamento. Não cometa o erro de pensar que você precisa aumentar as pressões de trabalho em suas garrafas de oxigênio e acetileno na esperança de obter uma chama mais quente. Tudo o que você faz é desperdiçar seu gás. Não há um único caso, exceto uma dica de 'Rosebud', em que suas pressões devam ser superiores a 8 psi. Um ponto crítico a ser considerado gira em torno das voltas da válvula da garrafa. A válvula de oxigênio necessita de abertura completa até que esteja firmemente assentada. Em contraste, a garrafa de acetileno requer uma abordagem mais sutil: ela só deve ser aberta o suficiente para estabelecer a pressão do tanque. Esse manejo diferenciado decorre de considerações de segurança: em emergências, o tanque de acetileno deve ser o primeiro a ser fechado, antes mesmo da garrafa de oxigênio, por isso sua abertura total é desaconselhada. Quanto à sequência de acendimento da tocha, é fundamental abrir primeiro a válvula de acetileno. Usando um percussor de pedra, acenda uma chama, ajustando-a até que a pronunciada fuligem de carbono diminua significativamente. Gradualmente, introduza oxigênio na chama, ajustando até atingir uma chama neutra. Após a conclusão da soldagem, é observado um protocolo rigoroso: desligar primeiro o acetileno, extinguindo a chama e depois o oxigênio. Esta sequência garante a ausência de acetileno persistente na ponta pós-operação.
zh_hans: 要测量水箱压力，一个简单的步骤是打开每个瓶子上的阀门。随后，调节器上的调节螺钉开始发挥作用。对这些进行调整，直到达到您想要的工作压力。例如，对于指定厚度为 1/8 英寸的#2 喷嘴，氧气和乙炔均应校准至 3 psi。需要理解的一件重要事情是：对于您可能使用的所有技巧，工作压力的比率始终是 1 比 1。氧气为 3 psi，乙炔为 3 psi，氧气为 5 psi，氧气为 5 psi，具体取决于您设备品牌的制造商。不要错误地认为您需要增加氧气瓶和乙炔瓶的工作压力，以期获得更热的火焰。你所做的一切都是在浪费你的汽油。除了“玫瑰花蕾”尖端之外，没有任何一种情况表明您的压力应超过 8 psi。 一个关键的考虑点围绕着瓶子的阀门转动。氧气阀需要完全打开，直到其牢固就位。相比之下，乙炔瓶需要更细致的方法：仅应打开足以建立储罐压力的位置。这种区别处理源于安全考虑：在紧急情况下，乙炔罐必须首先关闭，甚至先于氧气瓶，这就是为什么不鼓励其完全打开。 至于火炬点燃顺序，最重要的是先打开乙炔阀。使用火石击打器，点燃火焰，调整火焰，直到明显的碳烟明显减少。逐渐向火焰中引入氧气，微调直至达到中性火焰。焊接结束后，遵守严格的协议：首先关闭乙炔，熄灭火焰，然后熄灭氧气。此顺序确保操作后尖端中不存在残留的乙炔。

source: Which electrode to use? * E6010/E6011 are good choices if the material is dirty or there are some gaps to fill. On pipe work, E6010 is used for production root pass welding. It works well on galvanized metals because of its ability to penetrate through the galvanized coating. * E7018 is the all around go to electrode for practically every type of job you might encounter. It does not perform well on dirty metal or fit ups that are too wide. The 1/8" variety is what most people use on structural applications, but the 3/32" diameter should always be in a welder's posession for all around ease of use. * E7024 is not used that much. It is practical if you have to put down a lot of weld metal on a flat or horizontal joint. It works best in straight polarity. Regrettably, even seasoned welders sometimes falter in these theoretical areas. If you, as a reader, find yourself grappling with these concepts, do not yield to the allure of complacency. Embrace curiosity and the pursuit of knowledge. Seek out mentors, engage in discussions, or attend workshops. Ensuring you are well-acquainted with your equipment's ins and outs is not merely a professional asset; it's a safety imperative. In the world of welding, knowledge isn't just power – it's the backbone of precision, safety, and excellence.
es_419: ¿Qué electrodo usar? * E6010/E6011 son buenas opciones si el material está sucio o hay algunos huecos que llenar. En tuberías, el E6010 se utiliza para la soldadura de paso de raíz de producción. Funciona bien en metales galvanizados debido a su capacidad de penetrar a través del revestimiento galvanizado. * E7018 es el electrodo ideal para prácticamente cualquier tipo de trabajo que pueda encontrar. No funciona bien en metal sucio o ajustes demasiado anchos. La variedad de 1/8" es la que la mayoría de la gente usa en aplicaciones estructurales, pero el diámetro de 3/32" siempre debe estar en posesión del soldador para facilitar su uso. * E7024 no se usa mucho. Resulta práctico si hay que depositar mucho metal de soldadura en una junta plana u horizontal. Funciona mejor en polaridad directa. Lamentablemente, incluso los soldadores experimentados a veces fallan en estas áreas teóricas. Si usted, como lector, se encuentra lidiando con estos conceptos, no ceda al encanto de la complacencia. Abrazar la curiosidad y la búsqueda del conocimiento. Busque mentores, participe en debates o asista a talleres. Asegurarse de conocer bien los entresijos de su equipo no es simplemente una ventaja profesional; es un imperativo de seguridad. En el mundo de la soldadura, el conocimiento no es sólo poder: es la columna vertebral de la precisión, la seguridad y la excelencia.
fil_ph: Aling electrode ang gagamitin? * Ang E6010/E6011 ay mahusay na mga pagpipilian kung ang materyal ay marumi o may ilang mga puwang na dapat punan. Sa pipe work, ang E6010 ay ginagamit para sa production root pass welding. Ito ay mahusay na gumagana sa galvanized metal dahil sa kakayahan nitong tumagos sa pamamagitan ng galvanized coating. * Ang E7018 ay ang all around go to electrode para sa halos lahat ng uri ng trabaho na maaari mong makaharap. Hindi ito gumaganap nang maayos sa maruming metal o mga fit up na masyadong malawak. Ang 1/8" variety ay ang ginagamit ng karamihan sa mga structural application, ngunit ang 3/32" na diameter ay dapat palaging nasa welder's posession para sa lahat sa paligid ng kadalian ng paggamit. * Hindi gaanong ginagamit ang E7024. Ito ay praktikal kung kailangan mong maglagay ng maraming weld metal sa isang patag o pahalang na joint. Ito ay pinakamahusay na gumagana sa tuwid na polarity. Sa kasamaang palad, kahit na ang mga batikang welder ay naliligaw minsan sa mga teoretikal na lugar na ito. Kung ikaw, bilang isang mambabasa, ay nahahanap ang iyong sarili na nakikipagbuno sa mga konseptong ito, huwag sumuko sa pang-akit ng kasiyahan. Yakapin ang pagkamausisa at ang paghahanap ng kaalaman. Maghanap ng mga tagapayo, makisali sa mga talakayan, o dumalo sa mga workshop. Ang pagtiyak na pamilyar ka sa mga ins at out ng iyong kagamitan ay hindi lamang isang propesyonal na asset; ito ay isang kinakailangan sa kaligtasan. Sa mundo ng welding, ang kaalaman ay hindi lamang kapangyarihan - ito ang gulugod ng katumpakan, kaligtasan, at kahusayan.
ht: Ki elektwòd pou itilize? * E6010/E6011 se bon chwa si materyèl la sal oswa gen kèk twou vid ki genyen pou ranpli. Sou travay tiyo, E6010 yo itilize pou pwodiksyon pasaj rasin soude. Li travay byen sou metal galvanised paske nan kapasite li nan antre nan kouch galvanised la. * E7018 se tout otou ale nan elektwòd pou prèske tout kalite travay ou ta ka rankontre. Li pa fè byen sou metal sal oswa anfòm ups ki twò laj. Varyete a 1/8" se sa pifò moun itilize sou aplikasyon estriktirèl, men 3/32" dyamèt la ta dwe toujou nan posession yon soudeur pou tout alantou fasilite nan itilize. * E7024 pa itilize anpil. Li se pratik si ou gen mete desann yon anpil nan metal soude sou yon jwenti plat oswa orizontal. Li travay pi byen nan polarite dwat. Malerezman, menm soudeur chevronn pafwa ekilib nan domèn teyorik sa yo. Si ou menm, kòm yon lektè, jwenn tèt ou lite ak konsèp sa yo, pa sede nan atiran nan satisfaksyon. Anbrase kiryozite ak pouswit konesans. Chèche konseye, patisipe nan diskisyon, oswa ale nan atelye. Asire w konnen byen ak ekipman ou a se pa sèlman yon avantaj pwofesyonèl; li se yon impératif sekirite. Nan mond lan nan soude, konesans se pa sèlman pouvwa - li se kolòn vètebral la nan presizyon, sekirite, ak ekselans.
pt_br: Qual eletrodo usar? * E6010/E6011 são boas escolhas se o material estiver sujo ou se houver algumas lacunas a serem preenchidas. Em tubulações, o E6010 é usado para soldagem de passe de raiz de produção. Funciona bem em metais galvanizados devido à sua capacidade de penetrar no revestimento galvanizado. * E7018 é o eletrodo versátil para praticamente todos os tipos de trabalho que você possa encontrar. Não funciona bem em metal sujo ou em encaixes muito largos. A variedade de 1/8" é a que a maioria das pessoas usa em aplicações estruturais, mas o diâmetro de 3/32" deve estar sempre em posse do soldador para maior facilidade de uso. * E7024 não é muito usado. É prático se você tiver que colocar muito metal de solda em uma junta plana ou horizontal. Funciona melhor em polaridade direta. Lamentavelmente, mesmo soldadores experientes às vezes vacilam nessas áreas teóricas. Se você, como leitor, se deparar com esses conceitos, não ceda ao fascínio da complacência. Abrace a curiosidade e a busca pelo conhecimento. Procure mentores, participe de discussões ou participe de workshops. Garantir que você esteja bem familiarizado com os detalhes do seu equipamento não é apenas um recurso profissional; é um imperativo de segurança. No mundo da soldagem, conhecimento não é apenas poder – é a espinha dorsal da precisão, segurança e excelência.
zh_hans: 使用哪种电极？ * 如果材料较脏或有一些间隙需要填充，E6010/E6011 是不错的选择。在管道工程中，E6010 用于生产根部焊道焊接。它在镀锌金属上效果很好，因为它能够渗透镀锌涂层。 * E7018 是一款全能型电极，几乎适用于您可能遇到的所有类型的工作。它在脏金属或太宽的配件上表现不佳。大多数人在结构应用中使用 1/8" 直径，但焊工应始终掌握 3/32" 直径，以方便使用。 * E7024 使用得不多。如果您必须在平坦或水平接头上放置大量焊缝金属，那么它很实用。它在正极性时效果最佳。 遗憾的是，即使是经验丰富的焊工有时也会在这些理论领域陷入困境。如果您作为一名读者发现自己正在努力解决这些概念，请不要屈服于自满的诱惑。拥抱好奇心和对知识的追求。寻找导师、参与讨论或参加研讨会。确保您熟悉设备的细节不仅是一项专业资产，也是一项资产。这是安全的当务之急。在焊接领域，知识不仅仅是力量，还是精确、安全和卓越的支柱。
